app/views/shared/_user_info.html.erb

<span class = "content"><%= link_to "view my profile", current_user %></span>
<span class = "content"><%= pluralize(current_user.microposts.count, "micropost")%></span>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]