app/controllers/microposts_controller.rb

    def create
        @micropost = current_user.microposts.build(micropost_params)
        if @micropost.save
---
INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "A little art."], ["picture", "The_Escape_Artist.png"], ["user_id", 1], ["created_at", "2015-05-10 15:57:18.558660"], ["updated_at", "2015-05-10 15:57:18.558660"]]