app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$PdY1sEvQXSvTL7W3LuJigO5jfL1mXZx/egPvYF5guwwEikP0u0/Aa"], ["updated_at", "2015-05-06 04:26:46.052089"], ["id", 1]]
---
  def update
    if password_blank?
        flash.now[:danger] = "Password can't be blank."
        render 'edit'
    elsif @user.update_attributes(user_params)